/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strstr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jparteep <jparteep@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/05/15 21:48:25 by jparteep          #+#    #+#             */
/*   Updated: 2026/05/28 14:00:02 by jparteep         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
char	*ft_strstr(char *str, char *to_find)
{
	int	i;
	int	j;

	i = 0;
	if (to_find[0] == '\0')
	{
		return (str);
	}
	while (str[i] != '\0')
	{
		j = 0;
		while (str[i + j] == to_find[j] && to_find[j] != '\0')
		{
			j++;
		}
		if (to_find[j] == '\0')
		{
			return (&str[i]);
		}
		i++;
	}
	return (0);
}
int main(void)
{
	printf("%s\n", ft_strstr("CCat","Cat"));
	printf("%s\n", ft_strstr("CCat","\0"));
	char *result;
	result = ft_strstr("42Bangkok", "CCat");
	if (result == 0) // หรือใช้ if (result == NULL) ก็ได้
    {
        printf("Result is NULL (Not found!)\n");
    }
}

//คำอธิบาย (DESCRIPTION)

// strstr(): ทำหน้าที่ค้นหา "ข้อความย่อย (needle)" ว่ามีซ่อนอยู่ใน
// "ข้อความหลัก (haystack)" หรือไม่ โดยจะหาตำแหน่ง "แรกสุด" ที่เจอ
// (อุปมาเหมือนการงมเข็ม (needle) ในมหาสมุทร/กองฟาง (haystack) ครับ)

// การค้นหานี้จะไม่เอาตัวอักษรปิดท้าย (\0 หรือ Null byte) มาเปรียบเทียบด้วย

// ค่าที่ส่งกลับ (RETURN VALUE)
// ฟังก์ชันทั้งสองจะส่งค่ากลับเป็น พอยน์เตอร์ (Pointer) ตามเงื่อนไขดังนี้:

// ถ้าค้นหาเจอ: จะคืนค่า Pointer ที่ชี้ไปยัง "ตัวอักษรตัวแรก" 
// ของข้อความย่อยตำแหน่งที่หาเจอในข้อความหลัก

// ถ้าค้นหา "ไม่" เจอ: จะคืนค่าเป็น NULL

// กรณีพิเศษ: ถ้าข้อความย่อย (needle) เป็นข้อความว่างๆ (Empty string เช่น "") 
// ฟังก์ชันจะคืนค่าเป็น Pointer ของข้อความหลัก (haystack) 
// ตั้งแต่ตัวแรกสุดกลับไปเลย

//3

// 🚨 รอบที่ 4 (จุดเกิดเหตุ): ตำแหน่งที่ 3 ของทั้งสองฝั่งคือ \0 ถูกไหมครับ?

// พอโค้ดเช็คเงื่อนไข str[0+3] == to_find[3] มันคือการเอา \0 มาเทียบกับ \0

// ซึ่งผลลัพธ์มันดันเป็น จริง (True)! ทำให้โค้ดมุดเข้าไปทำ j++ กลายเป็น 4

// พอ j เป็น 4 ทีนี้มันไปอ่านค่าขยะใน Memory (Garbage memory) 
// ที่อยู่นอกพื้นที่ String ทันที และเสี่ยงโปรแกรมระเบิดครับ

// 🛠️ วิธีร่ายเวทมนตร์แก้ทาง:
// เราต้องใส่ "เบรกมือ" ให้กับ Loop ในครับ โดยบอกมันว่า 
// "แกจะเทียบกันได้นะ แต่ห้ามให้ตัว to_find วิ่งไปแตะ \0 เด็ดขาด 
// ถ้าแตะปุ๊บต้องเบรกทันที!"