#include <stdio.h>
int	ft_strcmp(char *s1, char *s2)
{
	int i = 0;
	int Diff;

	while(s1[i] == s2[i] && s1[i] != '\0' && s2[i] != '\0')
		{
			i++;
		}
	Diff = (unsigned char)s1[i] - (unsigned char)s2[i];
	return(Diff);
}

int main(void)
{
	printf("Diff :%d\n", ft_strcmp("abc", "abc"));
	printf("Diff :%d\n", ft_strcmp("abc", "abd"));
	printf("Diff :%d\n", ft_strcmp("abcd", "ab"));
	printf("Diff :%d\n", ft_strcmp("ab", "abcd"));
	printf("Diff :%d\n", ft_strcmp("", ""));
	printf("Diff :%d\n", ft_strcmp("abcd", ""));
	printf("Diff :%d\n", ft_strcmp("", "abcd"));
}

//เอาค่า ASCII ของตัวอักษร 'คู่แรก' ที่มันไม่เหมือนกันมาลบกันเสมอ

//คำอธิบาย (DESCRIPTION) แปลจากman
// ฟังก์ชัน strcmp() ใช้สำหรับเปรียบเทียบข้อความ (String) สองชุด คือ s1 และ s2

// การเปรียบเทียบนี้จะไม่นำเรื่องของการตั้งค่าภาษาในระบบ (locale) มาคิดรวมด้วย 
// (ถ้าต้องการเปรียบเทียบโดยอิงตามภาษา ให้ไปใช้ฟังก์ชัน strcoll(3) แทน)

// การเปรียบเทียบจะทำโดยมองตัวอักษรเป็นแบบ 
// unsigned characters (มองเป็นตัวเลขรหัส ASCII แบบจำนวนเต็มบวก)

// strcmp() จะส่งค่ากลับ (return) เป็นตัวเลขจำนวนเต็ม (integer) 
// เพื่อบอกผลลัพธ์ของการเปรียบเทียบ ดังนี้:

// คืนค่า 0 : ถ้า s1 และ s2 เท่ากัน (ข้อความเหมือนกันทุกประการ)

// คืนค่าติดลบ (< 0) : ถ้า s1 มีค่าน้อยกว่า s2

// คืนค่าเป็นบวก (> 0) : ถ้า s1 มีค่ามากกว่า s2

// 💡 เกร็ดความรู้เพิ่มเติมสำหรับการนำไปใช้งาน:
// คำว่า "น้อยกว่า" หรือ "มากกว่า" ในที่นี้ ไม่ได้วัดจากความยาวของข้อความ 
// นะครับ แต่วัดจาก "ค่า ASCII" ของตัวอักษรตำแหน่งแรกที่มันเจอว่าแตกต่างกัน

// ตัวอย่าง:
// สมมติว่าเปรียบเทียบ s1 = "Apple" กับ s2 = "Apolo"

// ตัว 'A' และ 'p' สองตัวแรกเหมือนกัน โปรแกรมจะข้ามไปดูตัวถัดไป

// ตัวที่สาม s1 คือ 'p' (ค่า ASCII 112) ส่วน s2 คือ 'o' (ค่า ASCII 111)

// เนื่องจาก 112 มากกว่า 111 ดังนั้น s1 จึงมากกว่า s2 
// (ฟังก์ชันนี้จะรีเทิร์นค่าเป็น บวก ทันที และหยุดการทำงานโดยไม่สนใจตัวอักษรที่เหลือ)