/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jparteep <jparteep@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/05/15 21:40:28 by jparteep          #+#    #+#             */
/*   Updated: 2026/05/28 16:23:19 by jparteep         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// #include <stdio.h>

int	ft_strncmp(char *s1, char *s2, unsigned int n)
{
	unsigned int	i;
	int				diff;

	i = 0;
	if (n == 0)
	{
		return (0);
	}
	while (s1[i] == s2[i] && s1[i] != '\0' && s2[i] != '\0' && i < n - 1)
	{
		i++;
	}
	diff = (unsigned char)s1[i] - (unsigned char)s2[i];
	return (diff);
}
// int main(void)
// {
// 	printf("Diff :%d\n", ft_strncmp("Hello","Hello", 5));
// 	printf("Diff :%d\n", ft_strncmp("Hello","HelZa", 3));
// 	printf("Diff :%d\n", ft_strncmp("Hello", "HelZa", 5));
// 	printf("Diff :%d\n", ft_strncmp("Hello", "World", 0));
// 	printf("Diff :%d\n", ft_strncmp("abc", "abc", 10));
// 	printf("Diff :%d\n", ft_strncmp("ab", "abc", 3));
// 	printf("Diff :%d\n", ft_strncmp("\200", "A", 1));
// }

//ตัวเลขที่ตามหลัง \ มันจะถูกมองเป็น "เลขฐานแปด (Octal)"
//ต้องทำเป็นฐาน10
//มันคือการใช้ Escape Sequence 
// เพื่อสร้างตัวอักษรพิเศษจากการกำหนดรหัส ASCII โดยตรง

//signed char เก็บค่าได้ตั้งแต่ -128 ถึง 127

// แบบที่ 1: ถ้าใช้ i < n (คือ i < 3)
// รอบที่ 1 (i = 0): ชี้ที่ตัว 'H' | เงื่อนไข 0 < 3 เป็นจริง ➡️ เข้าลูปไปทำ i++ (i กลายเป็น 1)

// รอบที่ 2 (i = 1): ชี้ที่ตัว 'e' | เงื่อนไข 1 < 3 เป็นจริง ➡️ เข้าลูปไปทำ i++ (i กลายเป็น 2)

// รอบที่ 3 (i = 2): ชี้ที่ตัว 'l' | เงื่อนไข 2 < 3 เป็นจริง ➡️ เข้าลูปไปทำ i++ (i กลายเป็น 3) ❌

// รอบที่ 4 (i = 3): เงื่อนไข 3 < 3 เป็นเท็จ ➡️ หลุดลูป!

// เมื่อหลุดลูป โปรแกรมจะมาทำบรรทัดสุดท้ายคือการเอาตัวอักษรมาลบกัน:
// return (s1[3] - s2[3]);
// ปัญหาเกิดตรงนี้ครับ! ตำแหน่งที่ 3 (Index 3) มันคือตัวอักษรตัวที่ 4 ('l' ตัวที่สอง) กลายเป็นว่าโปรแกรมไปเอาตัวอักษรเกินโควต้าที่เราตั้งไว้ (n = 3) มาลบกันซะงั้น

// แบบที่ 2: ถ้าใช้ i < n - 1 (แบบในโค้ดของคุณ คือ i < 2)
// รอบที่ 1 (i = 0): ชี้ที่ตัว 'H' | เงื่อนไข 0 < 2 เป็นจริง ➡️ เข้าลูปไปทำ i++ (i กลายเป็น 1)

// รอบที่ 2 (i = 1): ชี้ที่ตัว 'e' | เงื่อนไข 1 < 2 เป็นจริง ➡️ เข้าลูปไปทำ i++ (i กลายเป็น 2)

// รอบที่ 3 (i = 2): ชี้ที่ตัว 'l' | เงื่อนไข 2 < 2 เป็นเท็จ ➡️ หลุดลูปทันที!! โดยที่ไม่บวก i เพิ่มแล้ว (ค่า i ค้างอยู่ที่ 2) ✅